// src/features/featureGroups.js
// ✅ ข้อมูลทั่วไป
export const generalFeatures = {
    Last_Month_Weight_Check: "มีการตรวจเช็คน้ำหนักในเดือนที่ผ่านมาหรือไม่",
    Weighed_Twice_Check_in_Last_3_Months: "มีการตรวจเช็คน้ำหนักอย่างน้อย 2 ครั้งใน 3 เดือนที่ผ่านมาหรือไม่",
};

// 🧑‍🍼 ข้อมูลผู้เลี้ยงดู
export const caregiverFeatures = {
    Guardian: "เป็นผู้ดูแลหรือไม่",
    Is_Respondent_Biological_Mother: "เป็นมารดาผู้ให้กำเนิดหรือไม่",
};

// 🍚 ข้อมูลโภชนาการ
export const nutritionFeatures = {
    Vitamin_A_Intake_First_8_Weeks: "ได้รับวิตามินเอภายใน 8 สัปดาห์แรกหรือไม่",
    Given_Anything_to_Drink_in_First_6_Months: "ได้รับของเหลวนอกจากนมแม่ใน 6 เดือนแรกหรือไม่",
    Still_Breastfeeding: "ยังให้นมแม่อยู่หรือไม่",
    Breastfeeding_Count_DayandNight: "จำนวนครั้งให้นมทั้งวันและคืน",
    Received_Vitamin_or_Mineral_Supplements: "ได้รับอาหารเสริมหรือวิตามินแร่ธาตุ",
    Received_Plain_Water: "ได้รับน้ำเปล่าหรือไม่",
    Infant_Formula_Intake_Count_Yesterday: "ได้รับนมผงหรือไม่",
    Received_Animal_Milk: "ได้รับนมสัตว์หรือไม่",
    Received_Animal_Milk_Count: "จำนวนครั้งดื่มนมสัตว์",
    Received_Juice_or_Juice_Drinks: "ได้รับน้ำผลไม้หรือไม่",
    Received_Yogurt: "ได้รับโยเกิร์ตหรือไม่",
    Received_Yogurt_Count: "จำนวนครั้งบริโภคโยเกิร์ต",
    Received_Thin_Porridge: "ได้รับโจ๊กใส/ข้าวต้มเหลว",
    Received_Tea: "ได้รับชา",
    Received_Other_Liquids: "ได้รับของเหลวอื่น ๆ",
    Received_Grain_Based_Foods: "ได้รับอาหารจากธัญพืช",
    Received_Orange_Yellow_Foods: "ได้รับผักสีส้ม/เหลืองเข้ม",
    Received_White_Root_Foods: "ได้รับอาหารหัวแป้งสีขาว",
    Received_Dark_Green_Leafy_Veggies: "ได้รับผักใบเขียวเข้ม",
    Received_Ripe_Mangoes_Papayas: "ได้รับมะม่วง/มะละกอสุก",
    Received_Other_Fruits_Vegetables: "ได้รับผลไม้/ผักอื่น ๆ",
    Received_Meat: "ได้รับเนื้อสัตว์",
    Received_Eggs: "ได้รับไข่",
    Received_Fish_Shellfish_Seafood: "ได้รับปลา/หอย/อาหารทะเล",
    Received_Legumes_Nuts_Foods: "ได้รับอาหารจากถั่ว",
    Received_Dairy_Products: "ได้รับผลิตภัณฑ์นม",
    Received_Oil_Fats_Butter: "ได้รับน้ำมัน/ไขมัน/เนย",
    Received_Sugary_Foods: "ได้รับอาหารหวาน",
    Received_Chilies_Spices_Herbs: "ได้รับเครื่องเทศ/สมุนไพร",
    Received_Grubs_Snails_Insects: "ได้รับแมลง/หอย/หนอน",
    Received_Other_Solid_Semi_Solid_Food: "ได้รับอาหารแข็ง/กึ่งแข็งอื่น ๆ",
    Received_Salt: "ได้รับอาหารที่เติมเกลือ",
    Number_of_Times_Eaten_Solid_Food: "จำนวนมื้ออาหารแข็ง",
};

// 🧼 ข้อมูลสุขาภิบาล
export const sanitationFeatures = {
    Sanitary_Disposal: "กำจัดอุจจาระถูกสุขลักษณะหรือไม่",
    Child_before_or_after_eating_food: "เด็กล้างมือก่อน/หลังทานอาหาร",
    Child_wash_hand_before_or_after_eating_food: "เด็กล้างมือก่อน/หลังเข้าห้องน้ำ",
    Mom_wash_hand_before_or_after_cleaning_children: "แม่ล้างมือก่อน/หลังทำความสะอาดเด็ก",
    Mom_wash_hand_before_or_after_feeding_the_child: "แม่ล้างมือก่อน/หลังป้อนอาหาร",
};